Repository: ASHWINI-GUPTA/Card-Nudge
Catalog: lib/l10n/app_*.arb
Languages: hi

# appTitle
source: Card Nudge ðŸ””
hi: कार्ड नज 🔔

# welcomeTitle
source: Welcome to Card Nudge ðŸ””
hi: कार्ड नज में आपका स्वागत है 🔔

# welcomeSubtitle
source: Your Credit Card Companion!
hi: आपका क्रेडिट कार्ड साथी!

# welcomeDescription
source: Track your credit cards, payment dues, and never miss a payment again.
hi: अपने क्रेडिट कार्ड, भुगतान की तारीख और बकाया राशि को ट्रैक करें। अब कभी भुगतान मिस न करें।

# buttonOk
source: OK
hi: ठीक है

# buttonCancel
source: Cancel
hi: रद्द करें

# buttonClose
source: Close
hi: बंद करें

# buttonSave
source: Save
hi: सहेजें

# buttonAdd
source: Add
hi: जोड़ें

# buttonDelete
source: Delete
hi: हटाएं

# buttonEdit
source: Edit
hi: संपादित करें

# buttonArchive
source: Archive
hi: आर्काइव करें

# buttonRetry
source: Retry
hi: पुनः प्रयास करें

# buttonUndo
source: Undo
hi: पूर्ववत करें

# buttonHome
source: Home
hi: होम

# buttonAddCard
source: Add Card
hi: कार्ड जोड़ें

# buttonUpdateCard
source: Update Card
hi: कार्ड अपडेट करें

# buttonAddPayment
source: Create Payment Due
hi: भुगतान बकाया बनाएं

# retryButtonLabel
source: Retry
hi: पुनः प्रयास करें

# validationRequired
source: This field is required.
hi: यह फ़ील्ड ज़रूरी है।

# errorGeneric
source: An unexpected error occurred. Please try again or return to the home screen. If the problem persists, contact support.
hi: एक अनपेक्षित त्रुटि हुई। कृपया फिर से कोशिश करें या होम स्क्रीन पर जाएं। अगर समस्या बनी रहती है, तो सहायता से संपर्क करें।

source: Utilization
hi: उपयोग

# overUtilization
source: Overutilized Cards
hi: अधिक उपयोग किए गए कार्ड

source: Total Credit Limit
hi: कुल क्रेडिट सीमा

source: Quick Insights
hi: तेज़ जानकारी

# monthlyOverview
source: Payment Overview by Month
hi: मासिक भुगतान अवलोकन

# cardsScreenTitle
source: Your Cards
hi: आपके कार्ड

# cardsScreenSubtitle
source: Manage your credit cards and payments
hi: अपने क्रेडिट कार्ड और भुगतान प्रबंधित करें

# cardsScreenDescription
source: Keep track of your credit cards, payment dues, and upcoming payments.
hi: अपने क्रेडिट कार्ड, बकाया भुगतान और आगामी भुगतानों पर नज़र रखें।

# cardsScreenEmptyStateTitle
source: No Cards Added
hi: कोई कार्ड नहीं जोड़ा गया

# cardsScreenEmptyStateSubtitle
source: Add your credit cards to start tracking payments and dues.
hi: अपने क्रेडिट कार्ड जोड़ें ताकि भुगतान और बकाया ट्रैक करना शुरू हो सके।

# cardsScreenErrorTitle
source: Error Loading Cards
hi: कार्ड लोड करने में त्रुटि

# cardsScreenErrorSubtitle
source: There was an error loading your cards. Please try again later.
hi: आपके कार्ड लोड करने में त्रुटि हुई। कृपया बाद में फिर से कोशिश करें।

# cardDetailsScreenTitle
source: Card Details
hi: कार्ड विवरण

# cardDetailsScreenSubtitle
source: View and manage your card details
hi: अपने कार्ड विवरण देखें और प्रबंधित करें

# cardDetailsScreenDescription
source: View your card details, upcoming payments, and payment history.
hi: अपने कार्ड विवरण, आगामी भुगतान और भुगतान इतिहास देखें।

# addCardScreenTitle
source: Add Card
hi: कार्ड जोड़ें

# updateCardScreenTitle
source: Update Card
hi: कार्ड अपडेट करें

# addCardScreenSubtitle
source: Add a new credit card
hi: नया क्रेडिट कार्ड जोड़ें

# updateCardScreenSubtitle
source: Update your credit card details
hi: अपने क्रेडिट कार्ड विवरण अपडेट करें

# addCardScreenDescription
source: Enter your card details to start tracking payments and dues.
hi: भुगतान और बकाया ट्रैक करने के लिए अपने कार्ड विवरण दर्ज करें।

# updateCardScreenDescription
source: Update your card details to keep your payment information current.
hi: अपने भुगतान जानकारी को अपडेट रखने के लिए कार्ड विवरण अपडेट करें।

# cardNameLabel
source: Card Name *
hi: कार्ड का नाम *

# cardNameHint
source: Enter card name
hi: कार्ड का नाम दर्ज करें

# cardNameError
source: Card name is required.
hi: कार्ड का नाम ज़रूरी है।

# bankLabel
source: Bank *
hi: बैंक *

# bankHint
source: Select your bank
hi: अपना बैंक चुनें

source: Add Payment Due
hi: भुगतान बकाया जोड़ें

source: Edit Payment Due
hi: भुगतान बकाया संपादित करें

# dueAmountLabel
source: Due Amount *
hi: बकाया राशि *

# minimumDueLabel
source: Minimum Due (Optional)
hi: न्यूनतम बकाया (वैकल्पिक)

# paymentDateLabel
source: Payment Due Date *
hi: भुगतान की तारीख *

source: Select Date
hi: तारीख चुनें

# selectDateError
source: Please select a due date.
hi: कृपया बकाया तारीख चुनें।

# invalidAmountError
source: Enter a valid amount.
hi: सही राशि दर्ज करें।

# minimumDueExceedsError
source: Minimum due cannot exceed total due.
hi: न्यूनतम बकाया कुल बकाया से अधिक नहीं हो सकता।

# paymentAddedSuccess
source: Payment due added successfully!
hi: भुगतान बकाया सफलतापूर्वक जोड़ा गया!

# paymentUpdatedSuccess
source: Payment due updated successfully!
hi: भुगतान बकाया सफलतापूर्वक अपडेट किया गया!

# noDuePaymentAddedSuccess
source: No payment due added. You can add it later.
hi: कोई भुगतान बकाया नहीं जोड़ा गया। आप बाद में जोड़ सकते हैं।

# paymentAddError
source: Failed to add payment due.
hi: भुगतान बकाया जोड़ने में विफल।

# addDueButton
source: Payment
hi: भुगतान

# noPaymentDue
source: No Payment Required
hi: कोई भुगतान आवश्यक नहीं

# cardLabel
source: Card Name
hi: कार्ड का नाम

# networkLabel
source: Card Network
hi: कार्ड नेटवर्क

# last4DigitsLabel
source: Last 4 Digits
hi: अंतिम 4 अंक

# billingDateLabel
source: Billing Date
hi: बिलिंग तारीख

# dueDateLabel
source: Due Date
hi: बकाया तारीख

# creditLimitLabel
source: Credit Limit
hi: क्रेडिट सीमा

# last4DigitsError
source: Enter exactly 4 digits.
hi: ठीक 4 अंक दर्ज करें।

# invalidCreditLimitError
source: Enter a valid positive amount.
hi: सही सकारात्मक राशि दर्ज करें।

# selectDatesError
source: Please select billing and due dates.
hi: कृपया बिलिंग और बकाया तारीख चुनें।

# cardAddedSuccess
source: Card added successfully!
hi: कार्ड सफलतापूर्वक जोड़ा गया!

# cardUpdatedSuccess
source: Card updated successfully!
hi: कार्ड सफलतापूर्वक अपडेट किया गया!

# cardSaveError
source: Failed to save card.
hi: कार्ड सहेजने में विफल।

# dueDateBeforeBillingError
source: Due date must be after billing date
hi: बकाया तारीख बिलिंग तारीख के बाद होनी चाहिए

# saveButton
source: Save
hi: सहेजें

source: Log Payment
hi: भुगतान दर्ज करें

source: Total Due
hi: कुल बकाया

source: Minimum Due
hi: न्यूनतम बकाया

source: Custom Amount
hi: कस्टम राशि

# customAmountLabel
source: Custom Amount
hi: कस्टम राशि

# enterCustomAmount
source: Enter amount
hi: राशि दर्ज करें

# invalidCustomAmountError
source: Enter a valid positive amount.
hi: सही सकारात्मक राशि दर्ज करें।

# amountExceedsDueError
source: Amount cannot exceed total due.
hi: राशि कुल बकाया से अधिक नहीं हो सकती।

# paymentLoggedSuccess
source: Payment logged successfully!
hi: भुगतान सफलतापूर्वक दर्ज किया गया!

# paymentLogError
source: Failed to log payment.
hi: भुगतान दर्ज करने में विफल।

# logPaymentButton
source: Log Payment
hi: भुगतान दर्ज करें

# navigationError
source: Navigation error occurred.
hi: नेविगेशन त्रुटि हुई।

# paymentNotFoundError
source: Payment not found.
hi: भुगतान नहीं मिला।

# invalidBankError
source: Invalid bank selected.
hi: अमान्य बैंक चुना गया।

# cardDetailsTitle
source: Card Details
hi: कार्ड विवरण

# editCard
source: Update
hi: अपडेट करें

# deleteCard
source: Delete
hi: हटाएं

# archiveCard
source: Archive
hi: आर्काइव करें

source: Upcoming Payment
hi: आगामी भुगतान

# noUpcomingDueMessage
source: Add a payment to see it here.
hi: यहां देखने के लिए भुगतान जोड़ें।

# nextBillingDateMessage
source: Your next billing date is in {daysUntilBilling,plural, one{1 day} other{{daysUntilBilling} days}}.
hi: आपकी अगली बिलिंग तारीख {daysUntilBilling,plural, one{1 दिन} other{{daysUntilBilling} दिनों}} में है।

source: Payment History
hi: भुगतान इतिहास

# noPastPayments
source: No past payments available.
hi: कोई पुराना भुगतान उपलब्ध नहीं।

# paymentHistoryItem
source: Payment
hi: भुगतान

# upcomingPaymentCard
source: Upcoming Payment
hi: आगामी भुगतान

# cardNotFoundError
source: Card not found.
hi: कार्ड नहीं मिला।

# paymentLoadError
source: Couldn't load payments.
hi: भुगतान लोड नहीं हो सके।

# deleteCardConfirmation
source: Confirm Delete Card
hi: कार्ड हटाने की पुष्टि करें

# deleteCardMessage
source: Are you sure you want to delete this card? This action cannot be undone.
hi: क्या आप वाकई इस कार्ड को हटाना चाहते हैं? यह कार्रवाई वापस नहीं की जा सकती।

# cancelButton
source: Cancel
hi: रद्द करें

# deleteButton
source: Delete
hi: हटाएं

# cardDeletedSuccess
source: Card deleted successfully!
hi: कार्ड सफलतापूर्वक हटाया गया!

# cardDeleteError
source: Failed to delete card.
hi: कार्ड हटाने में विफल।

# archiveNotImplemented
source: Archive feature not yet available.
hi: आर्काइव सुविधा अभी उपलब्ध नहीं है।

# cardArchivedSuccess
source: Card archived successfully!
hi: कार्ड सफलतापूर्वक आर्काइव किया गया!

# deletePaymentMessage
source: Are you sure you want to delete this payment? This action cannot be undone.
hi: क्या आप वाकई इस भुगतान को हटाना चाहते हैं? यह कार्रवाई वापस नहीं की जा सकती।

# deletePaymentConfirmation
source: Confirm Delete Payment
hi: भुगतान हटाने की पुष्टि करें

# bankDetailsLoadError
source: Couldn't load bank details.
hi: बैंक विवरण लोड नहीं हो सके।

# favoriteCard
source: Mark as Favorite
hi: पसंदीदा के रूप में चिह्नित करें

# unfavoriteCard
source: Remove from Favorites
hi: पसंदीदा से हटाएं

# cardArchiveError
source: Failed to archive card.
hi: कार्ड आर्काइव करने में विफल।

source: Card added to favorites!
hi: कार्ड पसंदीदा में जोड़ा गया!

source: Card removed from favorites.
hi: कार्ड पसंदीदा से हटाया गया।

# cardFavoriteError
source: Failed to update favorite status.
hi: पसंदीदा स्थिति अपडेट करने में विफल।

source: Bank Logo
hi: बैंक लोगो

source: Due Today
hi: आज बकाया

# undoButton
source: Undo
hi: पूर्ववत करें

source: Current Due
hi: वर्तमान बकाया

# upcomingPaymentsTitle
source: Upcoming Payments
hi: आगामी भुगतान

# noPaymentsMessage
source: No Upcoming or Overdue Payments available.
hi: कोई आगामी या अतिदेय भुगतान उपलब्ध नहीं।

# addCardButton
source: Add Card
hi: कार्ड जोड़ें

# addPaymentButton
source: Create Payment Due
hi: भुगतान बकाया बनाएं

# invalidCardError
source: Invalid card selected.
hi: अमान्य कार्ड चुना गया।

# applyButton
source: Apply
hi: लागू करें

# resetButton
source: Reset
hi: रीसेट करें

# clearButton
source: Clear
hi: साफ करें

# editDueDateOnCard
source: Due date can be edited from the card details.
hi: बकाया तारीख को कार्ड विवरण से संपादित किया जा सकता है।

# dueAlreadyExist
source: A payment due already exists for this card.
hi: इस कार्ड के लिए पहले से ही एक बकाया भुगतान मौजूद है।

source: Spend Overview
hi: खर्च अवलोकन

# monthOnTime
source: On Time
hi: समय पर

# monthDelayed
source: Delayed
hi: विलंबित

# monthNotPaid
source: Not Paid
hi: भुगतान नहीं किया

# monthNoData
source: No Data
hi: कोई डेटा नहीं

# monthFuture
source: Future
hi: भविष्य

# dueScreenNoFilterMessage
source: No payments match your filters.
hi: आपके फ़िल्टर से कोई भुगतान मेल नहीं खाता।

# settingsScreenTitle
source: Settings
hi: सेटिंग्स

source: Edit Profile
hi: प्रोफ़ाइल संपादित करें

source: Language
hi: भाषा

source: English
hi: अंग्रेजी

source: Hindi
hi: हिंदी

source: Currency
hi: मुद्रा

source: Theme
hi: थीम

source: Light
hi: हल्का

source: Dark
hi: गहरा

source: System
hi: सिस्टम

source: Banks
hi: बैंक

source: Add Bank
hi: बैंक जोड़ें

source: Edit Bank
hi: बैंक संपादित करें

source: Delete Bank
hi: बैंक हटाएं

# deleteBankConfirm
source: Are you sure you want to delete this bank?
hi: क्या आप वाकई इस बैंक को हटाना चाहते हैं?

source: Payment Reminders
hi: भुगतान रिमाइंडर

source: Reminder Time
hi: रिमाइंडर समय

source: Export Data
hi: डेटा निर्यात करें

# exportDataSuccess
source: Data exported successfully!
hi: डेटा सफलतापूर्वक निर्यात किया गया!

# clearData
source: Clear Local Data
hi: स्थानीय डेटा साफ करें

# clearDataConfirm
source: Are you sure you want to clear all data? This action cannot be undone.
hi: क्या आप वाकई सारा डेटा साफ करना चाहते हैं? यह कार्रवाई वापस नहीं की जा सकती।

# clearDataSuccess
source: All data cleared successfully!
hi: सारा डेटा सफलतापूर्वक साफ किया गया!

source: App Version
hi: ऐप संस्करण

source: Terms & Conditions
hi: नियम और शर्तें

source: Privacy Policy
hi: गोपनीयता नीति

source: Contact Support
hi: सहायता से संपर्क करें

source: Save
hi: सहेजें

source: Cancel
hi: रद्द करें

source: Add
hi: जोड़ें

source: Delete
hi: हटाएं

# versionError
source: Error loading version
hi: संस्करण लोड करने में त्रुटि

source: Loading version...
hi: संस्करण लोड हो रहा है...

source: Sync Data
hi: डेटा सिंक करें

# syncDataSubtitle
source: Sync Data with the cloud to keep your information safe.
hi: अपनी जानकारी को सुरक्षित रखने के लिए डेटा को क्लाउड के साथ सिंक करें।

# syncDataSuccess
source: Data synced successfully!
hi: डेटा सफलतापूर्वक सिंक किया गया!

# syncDataError
source: Failed to sync data. Please try again.
hi: डेटा सिंक करने में विफल। कृपया फिर से कोशिश करें।

# syncDataInProgress
source: Syncing data...
hi: डेटा सिंक हो रहा है...

# syncPreference
source: Sync
hi: सिंक

# syncPreferenceSubtitle
source: Enable to sync your settings and data across devices.
hi: अपनी सेटिंग्स और डेटा को डिवाइसों में सिंक करने के लिए सक्षम करें।

# utilizationAlertDescription
source: Get notified when your credit card utilization exceeds this percentage.
hi: जब आपके क्रेडिट कार्ड का उपयोग इस प्रतिशत से अधिक हो, तो सूचना प्राप्त करें।

# utilizationAlert
source: Utilization Threshold
hi: उपयोग सीमा

source: Bank Name
hi: बैंक का नाम

source: Bank Code
hi: बैंक कोड

source: Support Number
hi: सहायता नंबर

source: Website
hi: वेबसाइट

source: Bank Color
hi: बैंक रंग

# selectColorLabel
source: Select Color
hi: रंग चुनें

source: Logout
hi: लॉगआउट

source: Overdue
hi: अतिदेय

source: Today
hi: आज

source: Paid
hi: भुगतान किया

source: Partially Paid
hi: आंशिक रूप से भुगतान किया

# noPaymentDueStatus
source: No Payment Due
hi: कोई भुगतान बकाया नहीं

source: Upcoming Due
hi: आगामी बकाया

source: Due tomorrow
hi: कल बकाया

# overdueByDays
source: Overdue by {days,plural, one{1 day} other{{days} days}}.
hi: {days,plural, one{1 दिन} other{{days} दिनों}} से अतिदेय।

# dueInDays
source: Due in {days,plural, one{1 day} other{{days} days}}.
hi: {days,plural, one{1 दिन} other{{days} दिनों}} में बकाया।

source: Paid on
hi: भुगतान किया गया

source: Due on
hi: बकाया है

source: Statement Amount
hi: विवरण राशि

# partiallyPaidAmount
source: Partially Paid:
hi: आंशिक रूप से भुगतान:

# autoDebitEnabledLabel
source: Auto Debit Enabled
hi: ऑटो डेबिट चालू किया गया है

# autoDebitEnabledTooltip
source: Automatic payment is enabled for this card
hi: इस कार्ड के लिए स्वचालित भुगतान सक्रिय है

source: AI Generated Summary
hi: एआई जनरेटेड सारांश

source: Card Benefits
hi: कार्ड लाभ

# noBenefitsSummaryAvailable
source: No benefits information available
hi: कोई लाभ जानकारी उपलब्ध नहीं है
